<a href="https://colab.research.google.com/github/gmarquez06/startpack-/blob/master/DS_Workshop.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [2]:
import numpy as np #Make mathematical operations & array processing faster
import pandas as pd #Used for data science processes for easy indexing and manipulation

In [9]:
#Lets create a dataframe and dictionary
#We know we are creating a dictionary because we see {Key : Values}
DATASAMPLEA = pd.DataFrame ({'Favorite Food' : ['Pizza', 'Burger', 'Steak', 'Ice Cream' ],
                             'FavoriteBrand' : ['Gucci', 'Prada', 'HNM', 'Zara']},
                             index=[0, 1, 2, 3]) #Organizes our table

In [10]:
DATASAMPLEA

  Favorite Food FavoriteBrand
0         Pizza         Gucci
1        Burger         Prada
2         Steak           HNM
3     Ice Cream          Zara

In [13]:
DATASAMPLEB = pd.DataFrame({'Favorite Movies': ['Slumdog', 'Mulan', 'Moana'], 'Favorite shoes' : ['Platform', 'Tennis', 'Sandals']}, index=[0,1,2])

In [14]:
DATASAMPLEB

  Favorite Movies Favorite shoes
0         Slumdog       Platform
1           Mulan         Tennis
2           Moana        Sandals

In [15]:
#Lets combine those data sample into a list inside a new variable
DATASAMPLES = [DATASAMPLEA, DATASAMPLEB]

In [16]:
DATASAMPLES

[  Favorite Food FavoriteBrand
 0         Pizza         Gucci
 1        Burger         Prada
 2         Steak           HNM
 3     Ice Cream          Zara,   Favorite Movies Favorite shoes
 0         Slumdog       Platform
 1           Mulan         Tennis
 2           Moana        Sandals]

In [17]:
#Now lets combine these data sets into one table
TOTALDATA= pd.concat(DATASAMPLES)

In [18]:
TOTALDATA

  Favorite Food FavoriteBrand Favorite Movies Favorite shoes
0         Pizza         Gucci             NaN            NaN
1        Burger         Prada             NaN            NaN
2         Steak           HNM             NaN            NaN
3     Ice Cream          Zara             NaN            NaN
0           NaN           NaN         Slumdog       Platform
1           NaN           NaN           Mulan         Tennis
2           NaN           NaN           Moana        Sandals

In [19]:
DATASAMPLEC = pd.DataFrame({'Favorite Cars' : ['Ferrari', 'BMW', 'Audi', 'Bently']}, index=[0,1,2,3])

In [20]:
DATASAMPLEC

  Favorite Cars
0       Ferrari
1           BMW
2          Audi
3        Bently

In [21]:
DATASAMPLES = [DATASAMPLEA, DATASAMPLEB, DATASAMPLEC]

In [22]:
TOTALDATA= pd.concat(DATASAMPLES)

In [23]:
TOTALDATA

  Favorite Food FavoriteBrand Favorite Movies Favorite shoes Favorite Cars
0         Pizza         Gucci             NaN            NaN           NaN
1        Burger         Prada             NaN            NaN           NaN
2         Steak           HNM             NaN            NaN           NaN
3     Ice Cream          Zara             NaN            NaN           NaN
0           NaN           NaN         Slumdog       Platform           NaN
1           NaN           NaN           Mulan         Tennis           NaN
2           NaN           NaN           Moana        Sandals           NaN
0           NaN           NaN             NaN            NaN       Ferrari
1           NaN           NaN             NaN            NaN           BMW
2           NaN           NaN             NaN            NaN          Audi
3           NaN           NaN             NaN            NaN        Bently

In [26]:
NEWTOTALDATA = pd.concat([DATASAMPLEA, DATASAMPLEB, DATASAMPLEC], axis=1) .reindex(DATASAMPLEA.index)

In [27]:
NEWTOTALDATA

  Favorite Food FavoriteBrand Favorite Movies Favorite shoes Favorite Cars
0         Pizza         Gucci         Slumdog       Platform       Ferrari
1        Burger         Prada           Mulan         Tennis           BMW
2         Steak           HNM           Moana        Sandals          Audi
3     Ice Cream          Zara             NaN            NaN        Bently

In [29]:
#Check for null and nan values 
NEWTOTALDATA.isnull().values.any()

True

In [32]:
NEWTOTALDATA = NEWTOTALDATA.replace('NaN','')

In [33]:
NEWTOTALDATA

  Favorite Food FavoriteBrand Favorite Movies Favorite shoes Favorite Cars
0         Pizza         Gucci         Slumdog       Platform       Ferrari
1        Burger         Prada           Mulan         Tennis           BMW
2         Steak           HNM           Moana        Sandals          Audi
3     Ice Cream          Zara             NaN            NaN        Bently

In [34]:
NEWTOTALDATA.fillna(0)

  Favorite Food FavoriteBrand Favorite Movies Favorite shoes Favorite Cars
0         Pizza         Gucci         Slumdog       Platform       Ferrari
1        Burger         Prada           Mulan         Tennis           BMW
2         Steak           HNM           Moana        Sandals          Audi
3     Ice Cream          Zara               0              0        Bently

In [35]:
NEWTOTALDATA.fillna("") #quickest way to replace Null/Nan values

  Favorite Food FavoriteBrand Favorite Movies Favorite shoes Favorite Cars
0         Pizza         Gucci         Slumdog       Platform       Ferrari
1        Burger         Prada           Mulan         Tennis           BMW
2         Steak           HNM           Moana        Sandals          Audi
3     Ice Cream          Zara                                       Bently

In [38]:
import base64
from IPython.display import HTML

def create_download_link( df3, title = "Download CSV file", filename = "Structured.csv"):
    csv = NEWTOTALDATA.to_csv()
    b64 = base64.b64encode(csv.encode())
    payload = b64.decode()
    html = '<a download="{filename}" href="data : text/csv;base64,{payload}" target="_blank">{title}</a>'
    html = html.format(payload=payload,title=title,filename=filename)
    return HTML(html)

create_download_link(NEWTOTALDATA)